Revit 2026 API

# AssetType Enumeration

---

Enumerated asset types

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AssetType
```
```vb
Public Enumeration AssetType
```
```cpp
public enum class AssetType
```
```fsharp
type AssetType
```

| Member name | Value | Description |
| --- | --- | --- |
| Appearance | 4 | Appearance assets (materials). |
| Content | 5 | Content assets (RPC / entourage). |

#### Reference

Autodesk.Revit.DB.Visual Namespace